Revit 2024 API
BuiltInFailures.SketchFailures.ManyDirectionCurves Property
 More than one direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ManyDirectionCurves { get; }
Visual Basic
Public Shared ReadOnly Property ManyDirectionCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ManyDirectionCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace